In [1]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

In [2]:
books_url = 'https://raw.githubusercontent.com/zygmuntz/goodbooks-10k/master/books.csv'
ratings_url = 'https://raw.githubusercontent.com/zygmuntz/goodbooks-10k/master/ratings.csv'

books_df = pd.read_csv(books_url)
ratings_df = pd.read_csv(ratings_url)

In [3]:
books_df.head()

   book_id  ...                                    small_image_url
0        1  ...  https://images.gr-assets.com/books/1447303603s...
1        2  ...  https://images.gr-assets.com/books/1474154022s...
2        3  ...  https://images.gr-assets.com/books/1361039443s...
3        4  ...  https://images.gr-assets.com/books/1361975680s...
4        5  ...  https://images.gr-assets.com/books/1490528560s...

[5 rows x 23 columns]

In [4]:
books_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 23 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   book_id                    10000 non-null  int64
 1   goodreads_book_id          10000 non-null  int64
 2   best_book_id               10000 non-null  int64
 3   work_id                    10000 non-null  int64
 4   books_count                10000 non-null  int64
 5   isbn                       9300 non-null   object
 6   isbn13                     9415 non-null   float64
 7   authors                    10000 non-null  object
 8   original_publication_year  9979 non-null   float64
 9   original_title             9415 non-null   object
 10  title                      10000 non-null  object
 11  language_code              8916 non-null   object
 12  average_rating             10000 non-null  float64
 13  ratings_count              10000 non-null  int64
 14  work_ratings_count         10000 non-null  int64
 15  work_text_reviews_count    10000 non-null  int64
 16  ratings_1                  10000 non-null  int64
 17  ratings_2                  10000 non-null  int64
 18  ratings_3                  10000 non-null  int64
 19  ratings_4                  10000 non-null  int64
 20  ratings_5                  10000 non-null  int64
 21  image_url                  10000 non-null  object
 22  small_image_url            10000 non-null  object
dtypes: float64(3), int64(13), object(7)
memory usage: 1.8+ MB

In [5]:
ratings_df.head()

   user_id  book_id  rating
0        1      258       5
1        2     4081       4
2        2      260       5
3        2     9296       5
4        2     2318       3

In [6]:
ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5976479 entries, 0 to 5976478
Data columns (total 3 columns):
 #   Column   Dtype
---  ------   -----
 0   user_id  int64
 1   book_id  int64
 2   rating   int64
dtypes: int64(3)
memory usage: 136.8 MB

In [7]:
ratings_df.sample(5)

         user_id  book_id  rating
1241594    13798       31       5
2777510    35364      853       3
2338795    28462      985       5
5111488    52080      326       4
559799      1724      526       4

Create a list of your book ratings from the existing books in the dataset

In [8]:
my_list = {'Martin Eden': 5,
            'Pet Sematary': 5,
            'One Hundred Years of Solitude': 5,
            'Ham on Rye': 5,
            'The Grapes of Wrath': 4, 
            "Cat's Cradle": 5,
            'Crime and Punishment': 4,
            'The Trial': 4}

In [9]:
# Create dataframe for new user (me)
user_books = pd.DataFrame(columns=['title', 'rating'], data=my_list.items())
user_books

                           title  rating
0                    Martin Eden       5
1                   Pet Sematary       5
2  One Hundred Years of Solitude       5
3                     Ham on Rye       5
4            The Grapes of Wrath       4
5                   Cat's Cradle       5
6           Crime and Punishment       4
7                      The Trial       4

In [10]:
# Add book_id from books_df
new_user = pd.merge(user_books, books_df, on='title', how='inner')
new_user = new_user[['book_id', 'title', 'rating']].sort_values(by='book_id')
new_user

   book_id                          title  rating
2       94  One Hundred Years of Solitude       5
4      131            The Grapes of Wrath       4
6      177           Crime and Punishment       4
5      297                   Cat's Cradle       5
1      305                   Pet Sematary       5
7      614                      The Trial       4
3     1444                     Ham on Rye       5
0     7068                    Martin Eden       5

In [11]:
other_users = ratings_df[ratings_df['book_id'].isin(new_user['book_id'].values)]
other_users

         user_id  book_id  rating
38             4      297       4
49             8      614       4
160           11       94       5
182            8      177       5
276            4      131       4
...          ...      ...     ...
5973753    39833       94       1
5973913    48436      297       4
5974295    51542       94       4
5974628     7607       94       5
5975419    19179      305       3

[27274 rows x 3 columns]

In [12]:
other_users['user_id'].nunique()

18637

In [13]:
# Sort users by count of most mutual books with me
users_mutual_books = other_users.groupby(['user_id'])
users_mutual_books = sorted(users_mutual_books, key=lambda x: len(x[1]), reverse=True)
users_mutual_books[0]

(47897,          user_id  book_id  rating
 4378842    47897      177       5
 4961030    47897      131       5
 4961036    47897     1444       5
 4961076    47897       94       5
 4961530    47897      297       5
 4961537    47897     7068       5
 4961543    47897      614       4)

In [14]:
top_users = users_mutual_books[:100]

In [15]:
# Pearson correlation
from scipy.stats import pearsonr

pearson_corr = {}

for user_id, books in top_users:
    # Books should be sorted
    books = books.sort_values(by='book_id')
    book_list = books['book_id'].values

    new_user_ratings = new_user[new_user['book_id'].isin(book_list)]['rating'].values 
    user_ratings = books[books['book_id'].isin(book_list)]['rating'].values

    corr = pearsonr(new_user_ratings, user_ratings)
    pearson_corr[user_id] = corr[0]

In [16]:
# Get top50 users with the highest similarity indices
pearson_df = pd.DataFrame(columns=['user_id', 'similarity_index'], data=pearson_corr.items())
pearson_df = pearson_df.sort_values(by='similarity_index', ascending=False)[:50]
pearson_df

    user_id  similarity_index
33    11862          1.000000
31    11274          0.912871
57    27747          0.912871
32    11356          0.872872
20     5426          0.866025
43    17944          0.763763
9      1027          0.763763
50    21646          0.745356
26     8616          0.720577
1     10898          0.707107
87      140          0.707107
92      523          0.688247
30    10672          0.666667
64    32198          0.666667
73    42899          0.645497
15     3582          0.612372
19     5078          0.612372
65    32245          0.612372
47    19462          0.612372
63    30359          0.600099
97      929          0.577350
91      453          0.577350
88      154          0.577350
0     47897          0.471405
46    18807          0.408248
61    28985          0.408248
12     1573          0.408248
56    27604          0.408248
60    28636          0.408248
25     8178          0.408248
29    10111          0.408248
28     9555          0.408248
66    32467          0.408248
75    45543          0.408248
16     4463          0.372678
44    18240          0.372678
3     22793          0.342997
98     1024          0.333333
69    35438          0.327327
27     9257          0.327327
7       257          0.327327
96      925          0.301511
83    53279          0.250000
34    12215          0.218218
79    51675          0.166667
71    39710          0.166667
8       349          0.166667
58    28017          0.166667
10     1138          0.102062
67    32921          0.080064

In [17]:
# Get all books for these users and add weighted book's ratings
users_rating = pearson_df.merge(ratings_df, on='user_id', how='inner')
users_rating['weighted_rating'] = users_rating['rating'] * users_rating['similarity_index']
users_rating

      user_id  similarity_index  book_id  rating  weighted_rating
0       11862          1.000000        4       4         4.000000
1       11862          1.000000        8       4         4.000000
2       11862          1.000000        5       3         3.000000
3       11862          1.000000       14       3         3.000000
4       11862          1.000000       50       3         3.000000
...       ...               ...      ...     ...              ...
6752    32921          0.080064      223       3         0.240192
6753    32921          0.080064     3418       1         0.080064
6754    32921          0.080064      184       4         0.320256
6755    32921          0.080064     7879       3         0.240192
6756    32921          0.080064     1258       3         0.240192

[6757 rows x 5 columns]

In [18]:
# Calculate sum of similarity index and weighted rating for each book
grouped_ratings = users_rating.groupby('book_id').sum()[['similarity_index', 'weighted_rating']]

In [19]:
recommend_books = pd.DataFrame()

# Add average recommendation score
recommend_books['avg_reccomend_score'] = grouped_ratings['weighted_rating']/grouped_ratings['similarity_index']
recommend_books['book_id'] = grouped_ratings.index
recommend_books = recommend_books.reset_index(drop=True)

# Left books with the highest score
recommend_books = recommend_books[(recommend_books['avg_reccomend_score'] == 5)]
recommend_books

      avg_reccomend_score  book_id
129                   5.0      145
130                   5.0      147
133                   5.0      151
157                   5.0      185
196                   5.0      245
...                   ...      ...
1887                  5.0     9463
1891                  5.0     9561
1892                  5.0     9605
1898                  5.0     9722
1915                  5.0     9978

[272 rows x 2 columns]

In [20]:
# Let's see our recomendations
recommendation = books_df[books_df['book_id'].isin(recommend_books['book_id'])][['authors', 'title', 'book_id']].sample(10)
recommendation

                                                authors  ... book_id
3103                               David Herbert Donald  ...    3104
6862               Flannery O'Connor, Robert Fitzgerald  ...    6863
1544                      A.A. Milne, Ernest H. Shepard  ...    1545
4119                                    Richard Dawkins  ...    4120
8078  Italo Calvino, William Weaver, Ανταίος Χρυσοστ...  ...    8079
8665                                       Paul Theroux  ...    8666
347                                         E. Lockhart  ...     348
2208                                William Shakespeare  ...    2209
6692                                   Robert Graysmith  ...    6693
1592                                   Raymond E. Feist  ...    1593

[10 rows x 3 columns]